In [2]:
import numpy as np
import pandas as pd

In [3]:
data = np.random.randn(4,3) # matriks

In [4]:
data

array([[-0.43737153, -0.14136314, -0.37461924],
       [ 0.38228467, -0.13551223, -0.29764899],
       [ 1.13193962, -0.34529926, -0.62422617],
       [ 0.06077358,  0.04986245,  0.74313405]])

In [5]:
dataFrame = pd.DataFrame(data)

In [6]:
dataFrame[0]  #dik olan ilk sırayı getirir

0   -0.437372
1    0.382285
2    1.131940
3    0.060774
Name: 0, dtype: float64

In [7]:
yeniDataFrame = pd.DataFrame(data,index=["atıl","zeynep","atlas","mehmet"],columns=["maas","yas","calismasaati"])

In [8]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [9]:
     yeniDataFrame["yas"]

atıl     -0.141363
zeynep   -0.135512
atlas    -0.345299
mehmet    0.049862
Name: yas, dtype: float64

In [10]:
yeniDataFrame["calismasaati"]

atıl     -0.374619
zeynep   -0.297649
atlas    -0.624226
mehmet    0.743134
Name: calismasaati, dtype: float64

In [11]:
yeniDataFrame[["yas","maas"]]#ikili olunca böyle yapcan

             yas      maas
atıl   -0.141363 -0.437372
zeynep -0.135512  0.382285
atlas  -0.345299  1.131940
mehmet  0.049862  0.060774

In [12]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [13]:
yeniDataFrame.loc["atıl"] # isme yani kolon olamyan yerdeki veriyi çekmek

maas           -0.437372
yas            -0.141363
calismasaati   -0.374619
Name: atıl, dtype: float64

In [14]:
#böyle de olur altta

In [15]:
yeniDataFrame.iloc[0] ### i ekledik loc başına indexe göre çekmek için

maas           -0.437372
yas            -0.141363
calismasaati   -0.374619
Name: atıl, dtype: float64

In [16]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [17]:
#kolon ekleme#

In [18]:
yeniDataFrame["maas"]

atıl     -0.437372
zeynep    0.382285
atlas     1.131940
mehmet    0.060774
Name: maas, dtype: float64

In [19]:
yeniDataFrame["emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]

In [20]:
yeniDataFrame

            maas       yas  calismasaati  emeklilik yasi
atıl   -0.437372 -0.141363     -0.374619       -0.282726
zeynep  0.382285 -0.135512     -0.297649       -0.271024
atlas   1.131940 -0.345299     -0.624226       -0.690599
mehmet  0.060774  0.049862      0.743134        0.099725

In [21]:
#silme#

In [22]:
yeniDataFrame.drop("emeklilik yasi",axis = 1 ) # ekseni belittik hata almamak için x y kordinatı gibi

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [23]:
 yeniDataFrame.drop("mehmet")  #kolonlarda axis belirtmen yeter

            maas       yas  calismasaati  emeklilik yasi
atıl   -0.437372 -0.141363     -0.374619       -0.282726
zeynep  0.382285 -0.135512     -0.297649       -0.271024
atlas   1.131940 -0.345299     -0.624226       -0.690599

In [24]:
yeniDataFrame

            maas       yas  calismasaati  emeklilik yasi
atıl   -0.437372 -0.141363     -0.374619       -0.282726
zeynep  0.382285 -0.135512     -0.297649       -0.271024
atlas   1.131940 -0.345299     -0.624226       -0.690599
mehmet  0.060774  0.049862      0.743134        0.099725

In [25]:
## gördüğün gibi kaydetmemeiş#

In [26]:
yeniDataFrame.drop("emeklilik yasi",axis = 1,inplace=True)

In [27]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [28]:
yeniDataFrame.loc["zeynep"]["yas"]

-0.1355122342323073

In [29]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [30]:
yeniDataFrame < 0

         maas    yas  calismasaati
atıl     True   True          True
zeynep  False   True          True
atlas   False   True          True
mehmet  False  False         False

In [31]:
booleanFrame = yeniDataFrame <0

In [32]:
booleanFrame

         maas    yas  calismasaati
atıl     True   True          True
zeynep  False   True          True
atlas   False   True          True
mehmet  False  False         False

In [33]:
yeniDataFrame[booleanFrame]

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep       NaN -0.135512     -0.297649
atlas        NaN -0.345299     -0.624226
mehmet       NaN       NaN           NaN

In [34]:
yeniDataFrame[yeniDataFrame<0]

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep       NaN -0.135512     -0.297649
atlas        NaN -0.345299     -0.624226
mehmet       NaN       NaN           NaN

In [35]:
yeniDataFrame[yeniDataFrame["yas"] > 0 ]

            maas       yas  calismasaati
mehmet  0.060774  0.049862      0.743134

In [36]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [37]:
yeniDataFrame.reset_index()

    index      maas       yas  calismasaati
0    atıl -0.437372 -0.141363     -0.374619
1  zeynep  0.382285 -0.135512     -0.297649
2   atlas  1.131940 -0.345299     -0.624226
3  mehmet  0.060774  0.049862      0.743134

In [38]:
#indexleme yaptı #

In [39]:
yeniDataFrame

            maas       yas  calismasaati
atıl   -0.437372 -0.141363     -0.374619
zeynep  0.382285 -0.135512     -0.297649
atlas   1.131940 -0.345299     -0.624226
mehmet  0.060774  0.049862      0.743134

In [40]:
#eskiye döndü ck kayıt emtedik

In [41]:
yeniIndex= ["ati","zey","atl","meh"]

In [42]:
yeniDataFrame["Yeni Index"] =yeniIndex

In [43]:
yeniDataFrame

            maas       yas  calismasaati Yeni Index
atıl   -0.437372 -0.141363     -0.374619        ati
zeynep  0.382285 -0.135512     -0.297649        zey
atlas   1.131940 -0.345299     -0.624226        atl
mehmet  0.060774  0.049862      0.743134        meh

In [44]:
yeniDataFrame.set_index("Yeni Index")

                maas       yas  calismasaati
Yeni Index
ati        -0.437372 -0.141363     -0.374619
zey         0.382285 -0.135512     -0.297649
atl         1.131940 -0.345299     -0.624226
meh         0.060774  0.049862      0.743134

In [45]:
yeniDataFrame

            maas       yas  calismasaati Yeni Index
atıl   -0.437372 -0.141363     -0.374619        ati
zeynep  0.382285 -0.135512     -0.297649        zey
atlas   1.131940 -0.345299     -0.624226        atl
mehmet  0.060774  0.049862      0.743134        meh

In [46]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [47]:
yeniDataFrame

                maas       yas  calismasaati
Yeni Index
ati        -0.437372 -0.141363     -0.374619
zey         0.382285 -0.135512     -0.297649
atl         1.131940 -0.345299     -0.624226
meh         0.060774  0.049862      0.743134

In [48]:
yeniDataFrame.loc["ati"]

maas           -0.437372
yas            -0.141363
calismasaati   -0.374619
Name: ati, dtype: float64

In [58]:
ilkindex=["kuzey","kuzey","kuzey","güney","güney","güney"]

In [59]:
icindex=["homer","bart","marge","cartman","kenny","kyle"]

In [60]:
birlesmisindex=list(zip(ilkindex,icindex))

In [61]:
birlesmisindex

[('kuzey', 'homer'),
 ('kuzey', 'bart'),
 ('kuzey', 'marge'),
 ('güney', 'cartman'),
 ('güney', 'kenny'),
 ('güney', 'kyle')]

In [62]:
birlesmisindex = pd.MultiIndex.from_tuples(birlesmisindex)

In [63]:
birlesmisindex

MultiIndex([('kuzey',   'homer'),
            ('kuzey',    'bart'),
            ('kuzey',   'marge'),
            ('güney', 'cartman'),
            ('güney',   'kenny'),
            ('güney',    'kyle')],
           )

In [69]:
cizgiList = [[40,"a"],[10,"b"],[30,"c"],[9,"d"],[12,"k"],[55,"s"]]

In [70]:
cizgiNumpy= np.array(cizgiList)

In [74]:
cizgiFilmDatasi= pd.DataFrame(cizgiNumpy,index=birlesmisindex,columns=["yas","meslek"])

In [75]:
cizgiFilmDatasi

              yas meslek
kuzey homer    40      a
      bart     10      b
      marge    30      c
güney cartman   9      d
      kenny    12      k
      kyle     55      s

In [76]:
cizgiFilmDatasi.loc["kuzey"]

      yas meslek
homer  40      a
bart   10      b
marge  30      c

In [77]:
cizgiFilmDatasi.loc["kuzey"].loc["bart"]

yas       10
meslek     b
Name: bart, dtype: object

In [78]:
cizgiFilmDatasi.index.names = ["Film adı","isim"]

In [79]:
cizgiFilmDatasi

                 yas meslek
Film adı isim
kuzey    homer    40      a
         bart     10      b
         marge    30      c
güney    cartman   9      d
         kenny    12      k
         kyle     55      s